Tekla Open API Reference for Tekla Structures 2025
Line Class
 The Line class represents a single infinite line in 3D space. See LineSegment for the implementation of a segment of a line.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.Line
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class Line
<SerializableAttribute>
Public Class Line
The Line type exposes the following members.
Constructors
Name | Description
Line()
 Instantiates a line with an undefined direction.
Line(LineSegment)
 Instantiates a line defined by the given line segment.
Line(Point, Point)
 Instantiates a line defined by the given points.
Line(Point, Vector)
 Instantiates a line defined by the given point and direction vector.
Top
Properties
Name | Description
Direction
 The direction vector of the line.
Origin
 The origin of the line.
Top
See Also
Reference
Tekla.Structures.Geometry3d Namespace